# Pi Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
SymbolTypeId..::..Pi Property
SymbolTypeId Class See Also
---
Symbol π, indicating unit Multiples of π.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId Pi { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property Pi As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ Pi {
	ForgeTypeId^ get ();
}
```

# See Also
SymbolTypeId Class
Autodesk.Revit.DB Namespace